'
''
's
,
0
00
000
01
02
03
04
05
06
08
1
10
100
11
12
120
13
133
14
140
15
16
17
18
19
2
20
200
2003
2004
2005
2006
2007
2008
2009
2010
2011
2012
21
22
23
24
25
256
25mn
26
27
28
29
3
30
300
31
32
33
34
35
358
36
37
38
39
4
40
400
41
42
43
44
45
46
47
470
48
49
5
50
500
51
52
54
55
56
57
59
6
60
600
63
64
65
68
7
70
700
71
74
8
80
800
81
83
86
88
9
90
99
\(
\)
\?
`
``
a
ab
about
above
abp
access
accessories
accordance
according
accounted
accounting
acquired
acquisition
activities
added
addition
address
administration
adp
adpnews
affecto
after
afx
ag
against
ago
agreed
agreement
agreements
ahlstrom
airline
aldata
all
alma
almost
already
also
am
america
american
among
amount
amounted
amounts
an
analysis
analysts
and
announced
announcement
annual
annually
another
any
application
applications
appointed
approved
approximately
april
are
area
areas
around
as
asia
aspo
aspocomp
asset
assets
association
at
atria
august
automation
autumn
available
awarded
b
back
baltic
bank
banking
banks
base
based
basis
basware
be
because
been
beer
before
beginning
being
belgium
below
between
bid
biggest
billion
biohit
biotie
block
bn
board
bond
book
both
branch
brand
brands
brazil
bridge
broadband
building
built
business
businesses
but
buy
buyout
by
called
calls
came
can
cap
capacity
capital
capman
cards
cargo
cargotec
carried
carrier
cash
category
cencorp
cent
center
central
centre
ceo
chain
chairman
change
changes
chargers
charging
chemical
chemicals
chief
china
city
citycon
close
closed
closing
clothing
co
coated
coatings
code
com
combined
come
comes
comments
commercial
commission
committee
communication
communications
companies
company
comparable
compared
competition
complete
completed
completion
componenta
components
comprises
comptel
computer
concern
concerning
conditions
conducted
conference
considerably
consists
consolidated
construction
consultancy
consumer
consumers
contact
content
continue
continued
continuing
contract
contracts
control
controlled
controls
cooperation
corp
corporate
corporation
corresponding
cost
costs
could
countries
country
cover
covers
cramo
cranes
credit
cross
currency
current
currently
customer
customers
cutting
czech
daily
danske
data
date
day
deal
debt
dec
december
decided
decision
declined
decrease
decreased
deliver
delivered
deliveries
delivery
demand
denmark
department
design
designs
details
developed
developer
development
device
devices
did
different
digia
digital
diluted
directed
director
directors
disclose
disclosed
distribution
district
divested
divided
dividend
division
does
domestic
doubled
down
drop
dropped
due
during
e
each
earlier
early
earnings
east
eastern
ebit
economic
eet
effect
effective
efficiency
efficient
eight
elcoteq
electrical
electricity
electronic
electronics
elisa
employees
employs
enable
enables
end
ended
energy
engaged
engineering
enso
enterprise
environment
environmental
eps
equipment
equity
especially
espoo
established
estate
estimate
estimated
estimates
estonia
eu
eur
eur0
eur1
eur10
eur13
eur15
eur2
eur3
eur4
eur5
euro
europe
european
euros
exchange
excluding
executive
exel
existing
expected
expects
experience
exports
f
face
facilities
facility
factory
fair
fall
favourable
feb
february
fell
field
figure
final
finance
financial
financing
fine
finland
finnair
finnish
finnlines
firm
first
fiscal
fish
fishing
fiskars
five
fixed
fleet
flexible
flights
floor
flow
focus
focusing
followed
following
food
for
forecast
forest
forestry
form
four
fourth
france
friday
from
full
function
functions
fund
funds
further
general
generated
germany
give
given
glass
glaston
global
going
goods
government
granted
grew
gross
group
growth
had
half
hand
handling
handset
has
have
he
head
headquartered
headquarters
heating
hel
held
helsinki
high
higher
his
hit
hk
hkscan
holding
holdings
holds
home
honkarakenne
hook
house
housing
how
however
huhtamaki
i
id
if
ilkka
impact
improve
improved
improvement
in
inc
incap
include
included
includes
including
income
increase
increased
index
india
indian
industrial
industries
industry
inen
information
infrastructure
installation
insurance
interest
interim
international
internet
into
invention
invested
investment
investments
investor
investors
invoice
iron
is
issue
issued
it
italy
items
its
ixonos
january
japan
joint
july
jumped
june
k
kemira
kesko
key
know
known
kone
konecranes
kymmene
l
land
large
larger
largest
last
later
latest
latvia
launched
lead
leading
least
lemminkainen
level
life
light
line
lines
liquid
listed
liters
lithuania
lithuanian
litres
live
loan
loans
local
located
logistics
london
long
loss
lost
low
lower
ltd
m
machine
machinery
made
magazine
mail
main
mainly
maintenance
major
make
maker
makes
making
mall
managed
management
manager
manages
managing
manufacture
manufacturer
manufacturers
manufactures
manufacturing
many
march
margin
marimekko
market
marketing
markets
material
materials
maximum
may
measurement
measures
meat
mechanical
media
meeting
member
members
metal
metals
method
metres
metso
mid
middle
mill
million
mining
mixed
mln
mn
mobile
model
models
monday
month
months
more
moscow
most
move
mr
much
n
name
named
narrowed
nasdaq
national
natural
near
nearly
need
needs
negative
negotiations
neste
net
network
networks
new
news
next
nickel
nine
no
nok
nokia
non
nonwovens
nordea
nordic
north
northern
norway
norwegian
not
november
now
number
nyse
oct
october
of
off
offer
offering
offers
office
offices
oil
okmetic
olvi
omx
on
one
online
only
open
operates
operating
operation
operational
operations
operator
operators
option
options
or
order
ordered
orders
ore
organization
oriola
orion
other
oulu
our
out
outlook
outokumpu
outotec
outside
over
overall
own
owned
owner
owns
oy
oyj
p
packaging
paid
panostaja
paper
papers
park
part
parties
partner
parts
passenger
passengers
patent
pay
payment
pct
pension
people
per
percent
performance
period
personal
personnel
persons
petersburg
pharmaceutical
pharmaceuticals
phone
phones
place
plan
planned
planning
plant
plants
players
plc
please
plus
pohjola
points
poland
portfolio
position
positions
positive
posted
potential
power
poyry
pre
preliminary
premises
present
president
press
pretax
previous
previously
price
prices
printing
prior
private
process
processing
producer
producing
product
production
products
profiles
profit
profitability
program
project
projects
properties
property
proposal
propose
proposed
provide
provided
provider
provides
public
publish
published
pulp
purchase
purchases
q1
q2
quality
quarter
quarterly
r
ragutis
raised
raisio
range
rapala
rate
rates
rautaruukki
raute
raw
real
receive
received
recent
recently
recommendation
record
recorded
recurring
refining
region
registered
registration
related
release
released
remain
remaining
rental
report
reported
reporting
reports
representing
republic
research
resources
respectively
responsibility
responsible
restructuring
result
results
retail
retailer
return
revenue
revenues
review
rights
rise
road
rose
rtrks
ruokatalo
russia
russian
ruukki
s
safety
said
salcomp
sale
sales
same
sampo
samsung
sanoma
sanomat
satama
savings
saw
says
scandinavian
scanfil
scheduled
scheme
science
se
sea
second
section
sector
sectors
secure
security
see
seen
segment
segments
sek
sell
senior
september
series
serve
serves
service
services
serving
set
several
shall
share
shareholder
shareholders
shares
ship
shipping
shop
shopping
short
showed
side
siemens
signed
significant
similar
since
site
situation
six
size
slightly
slipped
small
smaller
so
software
sold
solution
solutions
some
south
southern
space
special
specialises
specialty
sports
sq
square
st
staff
stainless
stake
standard
start
started
starting
state
statements
steel
stock
stockholm
stockmann
stonesoft
stood
stora
store
stores
strategic
street
strong
structure
structures
subject
subscribed
subscription
subscriptions
subsidiaries
subsidiary
such
summer
suomen
suominen
supplier
supplies
supply
support
surged
sweden
swedish
swung
system
systems
t
take
taken
talentum
talvivaara
tampere
target
tax
taxes
team
technical
technologies
technology
technopolis
tecnomen
tekla
tel
telecom
teleste
teliasonera
ten
term
terminal
terms
test
than
that
the
their
them
then
there
these
they
third
this
thomson
three
through
thursday
thus
tietoenator
tiimari
tikkurila
time
tlt1v
to
today
told
tonnes
tons
took
tools
top
total
totaled
totalled
trade
trading
traffic
transaction
transactions
transfer
transferred
transport
transportation
treatment
tuesday
turned
turnover
two
type
tyres
u
uk
under
underground
unit
united
units
until
up
upm
upon
uponor
us
usa
usd
use
used
using
vaahto
vaisala
value
valued
vantaa
various
vehicles
venture
versus
very
vessel
via
vice
video
viking
vmc
voice
volume
volumes
voting
warning
was
water
we
web
webcast
website
wednesday
week
well
went
were
what
when
where
which
while
who
whole
wholesale
will
wipes
wireless
with
within
won
wood
work
working
world
worldwide
worth
would
www
x20ac
year
years
yesterday
yit
your